Show / Hide Table of Contents
Class ReinfAroundOpening
Representing reinforcement around opening in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfAroundOpening
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Reinforcement))]
public class ReinfAroundOpening : ReinforcementGroup
Constructors
Improve this Doc   View Source
ReinfAroundOpening()
Constructor
Declaration
public ReinfAroundOpening()
Properties
Improve this Doc   View Source
AnchorLength
Anchor length of main bars
Declaration
public double AnchorLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiagonalDiameter
Diameter of diagonal reinforcement
Declaration
public double DiagonalDiameter { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiagonalDistance
Distance between diagonal reinforcement layers
Declaration
public double DiagonalDistance { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiagonalEndsType
End type of diagonal reinforcement bar
Declaration
public LongReinfEndType DiagonalEndsType { get; set; }
Property Value
 Type |  Description
 LongReinfEndType
Improve this Doc   View Source
DiagonalLength
length of diagonal bar
Declaration
public double DiagonalLength { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
DiagonalNumOfBarsInLayer
Number of diagonal bars in layer
Declaration
public int DiagonalNumOfBarsInLayer { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
DiagonalNumOfLayers
Number of diagonal layers
Declaration
public int DiagonalNumOfLayers { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
DiagonalReinforcement
Add diagonal reinforcement
Declaration
public bool DiagonalReinforcement { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
Distance
Distance between reinforcement layers
Declaration
public double Distance { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MasterComponent
Master component of reinforcement
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
NumOfLayers
Number of layers
Declaration
public int NumOfLayers { get; set; }
Property Value
 Type |  Description
 System.Int32
 Improve this Doc
 View Source